In [2]:
import pandas as pd 
import numpy as np

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
df = pd.read_csv(url, sep = '\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

# Step 4. See the first 10 entries

In [4]:
df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

# Step 5. What is the number of observations in the dataset?

In [11]:
print('the number of observations in the dataset is :',df.shape[0])

the number of observations in the dataset is : 4622

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

# Step 6. What is the number of columns in the dataset?

In [16]:
print('the number of columns in dataset is :',df.shape[1])

the number of columns in dataset is : 5

# Step 7. Print the name of all the columns.

In [17]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [23]:
for i in df.columns:
    print(i)

order_id
quantity
item_name
choice_description
item_price

# Step 8. How is the dataset indexed?

In [19]:
df.index

RangeIndex(start=0, stop=4622, step=1)

# Step 9. Which was the most-ordered item?

In [20]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [36]:
df.groupby(['item_name'])[['quantity']].sum().sort_values(by='quantity',ascending=False).head(1)

              quantity
item_name
Chicken Bowl       761

# Step 11. What was the most ordered item in the choice_description column?

In [38]:
df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [56]:
df.groupby(['choice_description'])[['quantity','order_id']].sum().sort_values(by='quantity', ascending=False).head(1)

                    quantity  order_id
choice_description
[Diet Coke]              159    123455

# Step 12. How many items were orderd in total?

In [57]:
df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [60]:
df['quantity'].count()

4622

# Step 13. Turn the item price into a float

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [63]:
df['item_price'].dtype

dtype('O')

In [64]:
df.item_price.astype(float)

ValueError: could not convert string to float: '$2.39 '

In [67]:
dollar = lambda x : float(x[1:-1])
df.item_price = df.item_price.apply(dollar)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 180.7+ KB

# Step 14. How much was the revenue for the period in the dataset?

In [69]:
df.head(3)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39

In [71]:
total_revenue = df.item_price.sum()
print('total revenue is:',total_revenue)

total revenue is: 34500.16

# Step 15. How many orders were made in the period?

In [72]:
df.head(3)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39

In [76]:
total_order = df['order_id'].drop_duplicates().count()
print('total order is :',total_order)

total order is : 1834

In [79]:
df['order_id'].value_counts().count()

1834

# Step 16. What is the average revenue amount per order?

In [80]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [89]:
df['revenue'] = df['quantity'] * df['item_price']
df.head()

,order_id,quantity,item_name,choice_description,item_price,revenue
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [93]:
df.groupby(['order_id'])[['revenue']].sum().mean()

revenue    21.394231
dtype: float64

# Step 17. How many different items are sold?

In [94]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,revenue
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [97]:
df['quantity'].drop_duplicates().sum()

55

In [100]:
df['item_name'].value_counts().count()

50

In [105]:
df['item_name'].drop_duplicates().reset_index(drop=True)

0              Chips and Fresh Tomato Salsa
1                                      Izze
2                          Nantucket Nectar
3     Chips and Tomatillo-Green Chili Salsa
4                              Chicken Bowl
5                             Side of Chips
6                             Steak Burrito
7                          Steak Soft Tacos
8                       Chips and Guacamole
9                      Chicken Crispy Tacos
10                       Chicken Soft Tacos
11                          Chicken Burrito
12                              Canned Soda
13                         Barbacoa Burrito
14                         Carnitas Burrito
15                            Carnitas Bowl
16                            Bottled Water
17    Chips and Tomatillo Green Chili Salsa
18                            Barbacoa Bowl
19                                    Chips
20                       Chicken Salad Bowl
21                               Steak Bowl
22                      Barbacoa Soft Tacos
23                           Veggie Burrito
24                              Veggie Bowl
25                       Steak Crispy Tacos
26      Chips and Tomatillo Red Chili Salsa
27                    Barbacoa Crispy Tacos
28                        Veggie Salad Bowl
29       Chips and Roasted Chili-Corn Salsa
30       Chips and Roasted Chili Corn Salsa
31                      Carnitas Soft Tacos
32                            Chicken Salad
33                        Canned Soft Drink
34                         Steak Salad Bowl
35                        6 Pack Soft Drink
36      Chips and Tomatillo-Red Chili Salsa
37                                     Bowl
38                                  Burrito
39                             Crispy Tacos
40                    Carnitas Crispy Tacos
41                              Steak Salad
42        Chips and Mild Fresh Tomato Salsa
43                        Veggie Soft Tacos
44                      Carnitas Salad Bowl
45                      Barbacoa Salad Bowl
46                                    Salad
47                      Veggie Crispy Tacos
48                             Veggie Salad
49                           Carnitas Salad
Name: item_name, dtype: object